{
  "title": "Data Privacy Consent",
  "sections": [
    {
      "heading": "Privacy Statement",
      "content": "This Privacy Notice explains how the Smart Queuing System collects, uses, stores, protects, and shares your personal data..."
    },
    {
      "heading": "Personal Information",
      "content": "We may collect and store the following information, among others, in our database:",
      "list": ["Full Name", "Address"]
    },
    {
      "heading": "Collection Method",
      "content": "We collect personal information manually or electronically through online application forms connected to the Smart Queuing System. As part of system operations, specific data—such as, but not limited to, the following—are automatically generated:",
      "list": ["Queue Numbers", "Timestamps", "Session IDs"],
      "additionalContent": "The system collects a copy of the consent text, in addition to the previously stated data, to establish proof of lawful processing in accordance with data privacy requirements."
    },
    {
      "heading": "Purpose of Collection",
      "content": "We collect your information to operate and improve the Smart Queuing System. This involves verifying your identity, assigning a queue number or ticket, processing QR scans for entry or tracking, preventing fraud or misuse, keeping system logs, generating analytics to enhance service quality, ensuring security, and meeting applicable legal and regulatory obligations."
    },
    {
      "heading": "Use of Data",
      "content": "The personal data collected will be used solely to manage and improve the queuing process within the participating institution.\n\nYour personal information is processed for the following purposes:",
      "list": [
        "To assign and manage queue numbers for applicants.",
        "To provide real-time updates regarding queue status.",
        "To assist personnel in administering queues and prioritizing applicants when necessary."
      ]
    },
    {
      "heading": "Disclosure of Personal Data",
      "content": "All personal data are handled with the highest degree of confidentiality. We will not disclose or make it accessible to any party unless required by law or authorized by your consent. When necessary, applicant inputs may be processed by external AI providers under strict safeguards to ensure that only the essential data is shared."
    },
    {
      "heading": "Data Protection & Security",
      "content": "Only duly authorized personnel may process personal data. We regularly assess and enhance all security measures to ensure compliance with the Data Privacy Act of 2012 (Republic Act No. 10173) and its Implementing Rules and Regulations (IRR)."
    },
    {
      "heading": "Storage & Disposal",
      "content": "Any personal data that is gathered is protected against any accidental or unlawful alteration, disclosure, or destruction, including against any form of unlawful processing. Appropriate measures are applied to store collected personal information securely, based on the nature or degree of the information.\n\nSensitive or administrative actions are further secured through device registration and two-factor authentication, with all activities being fully logged.\n\nWe retain data in accordance with established policies and legal requirements, as outlined below:",
      "list": [
        "Queue and Session Data are only kept during service fulfillment and are properly anonymized after.",
        "Entries are retained for one (1) to three (3) years to comply with legal and reporting requirements before being fully archived/anonymized.",
        "Audit Logs are kept for security monitoring while following retention schedules.",
        "Backups are created nightly using pg_dump field, and Write-Ahead Log shipping to an offline NAS; encrypted in storage, and transit."
      ]
    },
    {
      "heading": "Rights of Data Subjects",
      "content": "As a data subject under the Data Privacy Act of 2012 (RA 10173), you have the right to be informed whether your personal data is or will be processed, to access the data and information about how it is processed, to correct or update inaccurate or incomplete data, to block, remove, or erase data under certain conditions, to object to processing that is based on legitimate interests or is otherwise objectionable, to receive your data in a portable format where applicable, to be indemnified for damages arising from unauthorized or improper processing, and for these rights to be exercised by your lawful heirs or assigns if you are incapacitated or deceased."
    },
    {
      "heading": "Revision of Notice",
      "content": "Authorized personnel may periodically revise or update this Privacy Notice (for example, to reflect changes in law, system features, or data practices). The revised notice will be published on the website or within the System, and its effective date will be indicated. Significant changes will be communicated to you (e.g., via app notice, email, or on-site signage), and if required, we will obtain fresh consent before applying those changes. In case of a data breach, users who are affected, as well as the National Privacy Commission, will be notified as required by law."
    },
    {
      "heading": "Author of notice",
      "content": "The Smart Queuing System (name subject to change) issues this Privacy Notice in its capacity as the Personal Information Controller, dated 20 September 2025.\n\nApproval: Smart Queuing System"
    }
  ]
}
